Masmiseim36/nxpSDK/boards/frdmk82f/bootloader_examples/freedom_bootloader/pin_mux.h
/*
 * Copyright 2020 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*! @name PORTC14 (number 86), OpenSDA_UART
  @{ */
#define UART4_POLLFORACTIVITY_RX_GPIO_GPIO GPIOC /*!<@brief GPIO device name: GPIOC */
#define UART4_POLLFORACTIVITY_RX_GPIO_PORT PORTC /*!<@brief PORT device name: PORTC */
#define UART4_POLLFORACTIVITY_RX_GPIO_PIN 14U    /*!<@brief PORTC pin index: 14 */
                                                 /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void UART4_PollForActivity(void);

/*! @name PORTC14 (number 86), OpenSDA_UART
  @{ */
#define UART4_RX_PORT PORTC /*!<@brief PORT device name: PORTC */
#define UART4_RX_PIN 14U    /*!<@brief PORTC pin index: 14 */
                            /* @} */

/*! @name PORTC15 (number 87), OpenSDA_UART
  @{ */
#define UART4_TX_PORT PORTC /*!<@brief PORT device name: PORTC */
#define UART4_TX_PIN 15U    /*!<@brief PORTC pin index: 15 */
                            /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void UART4_InitPins(void);

/*! @name PORTC14 (number 86), OpenSDA_UART
  @{ */
#define UART4_RESTOREDEFAULT_RX_PORT PORTC /*!<@brief PORT device name: PORTC */
#define UART4_RESTOREDEFAULT_RX_PIN 14U    /*!<@brief PORTC pin index: 14 */
                                           /* @} */

/*! @name PORTC15 (number 87), OpenSDA_UART
  @{ */
#define UART4_RESTOREDEFAULT_TX_PORT PORTC /*!<@brief PORT device name: PORTC */
#define UART4_RESTOREDEFAULT_TX_PIN 15U    /*!<@brief PORTC pin index: 15 */
                                           /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void UART4_RestoreDefault(void);

/*! @name PORTC10 (number 82), J1[12]/D5/LEDRGB_BLUE
  @{ */
#define I2C1_SCL_PORT PORTC /*!<@brief PORT device name: PORTC */
#define I2C1_SCL_PIN 10U    /*!<@brief PORTC pin index: 10 */
                            /* @} */

/*! @name PORTC11 (number 83), J1[10]/D4
  @{ */
#define I2C1_SDA_PORT PORTC /*!<@brief PORT device name: PORTC */
#define I2C1_SDA_PIN 11U    /*!<@brief PORTC pin index: 11 */
                            /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void I2C1_InitPins(void);

/*! @name PORTC10 (number 82), J1[12]/D5/LEDRGB_BLUE
  @{ */
#define I2C1_RESTOREDEFAULT_SCL_PORT PORTC /*!<@brief PORT device name: PORTC */
#define I2C1_RESTOREDEFAULT_SCL_PIN 10U    /*!<@brief PORTC pin index: 10 */
                                           /* @} */

/*! @name PORTC11 (number 83), J1[10]/D4
  @{ */
#define I2C1_RESTOREDEFAULT_SDA_PORT PORTC /*!<@brief PORT device name: PORTC */
#define I2C1_RESTOREDEFAULT_SDA_PIN 11U    /*!<@brief PORTC pin index: 11 */
                                           /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void I2C1_RestoreDefault(void);

/*! @name PORTD4 (number 95), J2[6]/D10/SPI0_PCS1
  @{ */
#define SPI1_PCS_PORT PORTD /*!<@brief PORT device name: PORTD */
#define SPI1_PCS_PIN 4U     /*!<@brief PORTD pin index: 4 */
                            /* @} */

/*! @name PORTD5 (number 96), J22[5]/RF_SPI1_SCK
  @{ */
#define SPI1_SCK_PORT PORTD /*!<@brief PORT device name: PORTD */
#define SPI1_SCK_PIN 5U     /*!<@brief PORTD pin index: 5 */
                            /* @} */

/*! @name PORTD6 (number 97), J22[6]/RF_SPI1_SOUT
  @{ */
#define SPI1_SOUT_PORT PORTD /*!<@brief PORT device name: PORTD */
#define SPI1_SOUT_PIN 6U     /*!<@brief PORTD pin index: 6 */
                             /* @} */

/*! @name PORTD7 (number 100), J22[7]/RF_SPI1_SIN
  @{ */
#define SPI1_SIN_PORT PORTD /*!<@brief PORT device name: PORTD */
#define SPI1_SIN_PIN 7U     /*!<@brief PORTD pin index: 7 */
                            /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void SPI1_InitPins(void);

/*! @name PORTD4 (number 95), J2[6]/D10/SPI0_PCS1
  @{ */
#define SPI1_RESTOREDEFAULT_PCS_PORT PORTD /*!<@brief PORT device name: PORTD */
#define SPI1_RESTOREDEFAULT_PCS_PIN 4U     /*!<@brief PORTD pin index: 4 */
                                           /* @} */

/*! @name PORTD5 (number 96), J22[5]/RF_SPI1_SCK
  @{ */
#define SPI1_RESTOREDEFAULT_SCK_PORT PORTD /*!<@brief PORT device name: PORTD */
#define SPI1_RESTOREDEFAULT_SCK_PIN 5U     /*!<@brief PORTD pin index: 5 */
                                           /* @} */

/*! @name PORTD6 (number 97), J22[6]/RF_SPI1_SOUT
  @{ */
#define SPI1_RESTOREDEFAULT_SOUT_PORT PORTD /*!<@brief PORT device name: PORTD */
#define SPI1_RESTOREDEFAULT_SOUT_PIN 6U     /*!<@brief PORTD pin index: 6 */
                                            /* @} */

/*! @name PORTD7 (number 100), J22[7]/RF_SPI1_SIN
  @{ */
#define SPI1_RESTOREDEFAULT_SIN_PORT PORTD /*!<@brief PORT device name: PORTD */
#define SPI1_RESTOREDEFAULT_SIN_PIN 7U     /*!<@brief PORTD pin index: 7 */
                                           /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void SPI1_RestoreDefault(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
